OCOBOL >>SOURCE FORMAT IS FIXED
       identification division.
       program-id. hello.

       data division.
       procedure division.
       display "Hello World".
       stop run.
